%Дата последнего изменения файла 26-05-2017
%\nonstopmode
\documentclass[12pt]{book}
\include{format-izv}
%-------------------------------------------------
\theoremstyle{plain}
%Нумерованные
\newtheorem{theorem}{\indent Теорема}
\newtheorem{lemma}{\indent Лемма}
\newtheorem{corollary}{\indent Следствие}
\newtheorem{prop}{\indent Утверждение}
\newtheorem{propos}{\indent Предложение}
\newtheorem{problem}{\indent Задача}
\newtheorem{Theorem}{\indent Theorem}
\newtheorem{hypothesis}{\indent Предположение}
\newtheorem{Etheorem}{\indent Theorem}
\newtheorem{Eproposition}{\indent Proposition}
\newtheorem{Corollary}{\indent Corollary}
\newtheorem{Lemma}{\indent Lemma}
\newtheorem{theoremb}{\indent Теорема}
\renewcommand{\thetheoremb}{\Alph{theoremb}}%Нумерация теорем A, B, C

\usepackage{listings}

\usepackage{hyperref}
\usepackage{url}
 
\usepackage{color}

\definecolor{codegreen}{rgb}{0,0.6,0}
\definecolor{codegray}{rgb}{0.5,0.5,0.5}
\definecolor{codemaroon}{RGB}{128,0,0}
\definecolor{codenavy}{RGB}{0,0,128}
\definecolor{backcolour}{rgb}{0.95,0.95,0.92}
 
\lstdefinestyle{mystyle}{
    backgroundcolor=\color{backcolour},   
    commentstyle=\color{codegreen},
    keywordstyle=\color{codenavy},
    numberstyle=\tiny\color{codegray},
    stringstyle=\color{codemaroon},
    basicstyle=\footnotesize,
    breakatwhitespace=false,         
    breaklines=true,                 
    captionpos=b,                    
    keepspaces=true,                 
    numbers=left,                    
    numbersep=5pt,                  
    showspaces=false,                
    showstringspaces=false,
    showtabs=false,                  
    tabsize=2
}
 
\lstset{style=mystyle}
 
\usepackage{graphicx}

%Двойная нумерация
\newtheorem{theoremnn}{\indent Теорема}[section]
\newtheorem{lemmann}{\indent Лемма}[section]
\newtheorem{corollarynn}{\indent Следствие}[section]
\newtheorem{propnn}{\indent Утверждение}[section]
\newtheorem{proposnn}{\indent Предложение}[section]
\newtheorem{hypothesisnn}{\indent Предположение}[section]

\theoremstyle{plain}
%Ненумерованные окружения
\newtheorem*{theorem*}{\indent Теорема}%Просто теорема (без номера)
\newtheorem*{lemma*}{\indent Лемма}
\newtheorem*{corollary*}{\indent Следствие}
\newtheorem*{Corollary*}{\indent Corollary}
\newtheorem*{prop*}{\indent Утверждение}
\newtheorem*{propos*}{\indent Предложение}
\newtheorem*{hypothesis*}{\indent Предположение}
%-------------------------------------------------
\theoremstyle{definition}
\newtheorem{definitionn}{\indent Определение}[section]
\newtheorem{remarknn}{\indent Замечание}[section]
\newtheorem{examplenn}{\indent Пример}[section]

\newtheorem{definition}{\indent Определение}
\newtheorem{remark}{\indent Замечание}
\newtheorem{example}{\indent Пример}
\newtheorem{Remark}{\indent Remark}
\newtheorem{Question}{\indent Question}
\newtheorem{Definition}{\indent Definition}

\newtheorem*{definition*}{\indent Определение}
\newtheorem*{remark*}{\indent Замечание}
\newtheorem*{example*}{\indent Пример}

\renewenvironment{proof}{\indent\textbf{Доказательство. }}{\hfill$\Box$}

\newcommand{\const}{\mathrm{const}}
\newcommand{\Span}{\mathrm{Span}\,}
\renewcommand{\Re}{\,\mathrm{Re}\,}
\renewcommand{\Im}{\,\mathrm{Im}\,}
\newcommand{\sgn}{\mathrm{sgn}\,}
\newcommand{\diag}{\mathrm{diag}\,}
%\numberwithin{equation}{section}%Двойная нумерация формул
%Если Вы подключаете новый пакет, то обязательно сообщите об этом в комментариях к тексту статьи.
\begin{document}
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
\fancyhead[CE]{ИНФОРМАТИКА, ВЫЧИСЛИТЕЛЬНАЯ ТЕХНИКА И УПРАВЛЕНИЕ}%Раздел журнала
\fancyhead[CO]{Е.~М.~Смыкова, А.~А.~Крижановский. Анализ трёх аспектов современных стран по Викиданным:возраст стран, популярные формы правления и этнохоронимы}%

\UDC{519.689}

\Rtitle{АНАЛИЗ ТРЁХ АСПЕКТОВ СОВРЕМЕННЫХ СТРАН ПО ВИКИДАННЫМ:ВОЗРАСТ СТРАН, ПОПУЛЯРНЫЕ ФОРМЫ ПРАВЛЕНИЯ И ЭТНОХОРОНИМЫ}%

%\thispagestyle{izsc}%не убирать!!!
\Rauthor{Е.~М.~Смыкова$^1$, А.~А.~Крижановский$^2$}%Если автор один, то номер не ставить

%Фамилия Имя отчество, ученая степень, должность (с указанием кафедры, отдела), место работы (полное
%официальное название учреждения, почтовый адрес), e-mail;
\Raffil{$^1$Смыкова Елизавета Михаловна, студентка Петрозаводского Государственного Университета, Россия, 185910, Петрозаводск, Ленина, 33, esmykova8@gmail.com\\
$^2$Крижановский Андрей Анатольевич, кандидат технических наук,  руководитель 
Лаборатории информационных компьютерных технологий 
Института прикладных математических исследований, Россия, 185910 , Петрозаводск, Пушкинская, 11, andrew.krizhanovsky@gmail.com}

\Rabstract{Эта статья посвящена исследованию стран на основе базы знаний международного проекта Викиданные. С помощью SPARQL-запросов, вычисляемых на объектах типа "страна" в Викиданных, получены: выведен список всех ныне существующих стран, перечень стран, упорядоченных по дате создания, список этнохоронимов стран, пузырьковая диаграмма с формами правления стран и граф соседних стран. Кроме того, сделаны отностительно полноты Викиданных по данной теме.}

\Rkeywords{Викиданные, анализ данных, страны}

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%Текст статьи
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

\section{ЭКЗЕМПЛЯРЫ ОБЪЕКТА СТРАНА}\label{Sec1}

Построим список всех стран.

\begin{itemize}
    \item Объект: \href{https://www.wikidata.org/wiki/Q6256}{страна (Q6256)},
    \item Свойство: \href{https://www.wikidata.org/wiki/Property:P31}{экземпляр (P31)}.
\end{itemize}

\begin{lstlisting}[language=SPARQL, label=instcountry, caption=Список стран]
#List of `instances of` "country" 
SELECT ?lang ?langLabel
WHERE
{
    ?lang wdt:P31 wd:Q6256.
    SERVICE wikibase:label { bd:serviceParam wikibase:language "en" }
}
\end{lstlisting}

\href{https://query.wikidata.org/#%23added%202017-02%0A%23List%20of%20%60instances%20of%60%20%22country%22%20%0ASELECT%20%3Flang%20%3FlangLabel%0AWHERE%0A%7B%0A%20%20%20%20%3Flang%20wdt%3AP31%20wd%3AQ6256.%0A%20%20%20%20SERVICE%20wikibase%3Alabel%20%7B%20bd%3AserviceParam%20wikibase%3Alanguage%20%22en%22%20%7D%0A%7D}{SPARQL-запрос}, 198 записей

"+": Примерами наиболее полных и проработанных стран на Викиданных являются:
\href{https://www.wikidata.org/wiki/Q30}{Соединённые Штаты Америки}, 
\href{https://www.wikidata.org/wiki/Q16}{Канада},
\href{https://www.wikidata.org/wiki/Q29}{Испания}.

"$-$": Почти пустыми и малоинформативными странами оказались:
\href{https://www.wikidata.org/wiki/Q40362}{Сахарская Арабская Демократическая Республика},
\href{https://www.wikidata.org/wiki/Q907112}{Приднестровская Молдавская Республика},
\href{https://www.wikidata.org/wiki/Q1246}{Косово}.

\section{ВОЗРАСТ СТРАН}

Построим список стран, отсортированных по дате основания страны (первом упоминании о стране).

\begin{itemize}
    \item Объект: \href{https://www.wikidata.org/wiki/Q6256}{страна (Q6256)},
    \item Свойство: \href{https://www.wikidata.org/wiki/Property:P571}{дата основания (P571)}.
\end{itemize}

\begin{lstlisting}[language=SPARQL, label=countryinception, caption=Список стран упорядоченных по дате создания]
#List of `instances of` "countries sorted by inception" 
SELECT ?country ?countryLabel ?inception
WHERE
{
    ?country wdt:P31 wd:Q6256.       #country
    ?country wdt:P571 ?inception .   #inception of country
    
    SERVICE wikibase:label { bd:serviceParam wikibase:language "en" }
}
ORDER BY (?inception)
\end{lstlisting}


\href{https://query.wikidata.org/#%23List%20of%20%60instances%20of%60%20%22countries%20sorted%20by%20inception%22%20%0ASELECT%20%3Fcountry%20%3FcountryLabel%20%3Finception%0AWHERE%0A%7B%0A%20%20%20%20%3Fcountry%20wdt%3AP31%20wd%3AQ6256.%0A%20%20%20%20%3Fcountry%20wdt%3AP571%20%3Finception%20.%0A%20%20%20%20%0A%20%20%20%20SERVICE%20wikibase%3Alabel%20%7B%20bd%3AserviceParam%20wikibase%3Alanguage%20%22en%22%20%7D%0A%7D%0A%0AORDER%20BY%20%28%3Finception%29}{SPARQL-запрос}, 112 записей.

В результате выполнения запроса ~\ref{countryinception} получен список стран с датами их создания. Например, \href{https://www.wikidata.org/wiki/Q23334}{Абхазия} -- 1 января 0786, \href{https://www.wikidata.org/wiki/Q159}{Россия} -- 1 января 0862, \href{https://www.wikidata.org/wiki/Q1246}{Косово} -- 17 февряля 2008, \href{https://www.wikidata.org/wiki/Q958}{Южный Судан} -- 9 июля 2011.

Годы, в которые было создано наибольшее количество стран -- 1991 (17 стран), 1812 (6 стран) и 1918 (5 стран). 

\section{ПОЛНОТА ВИКИДАННЫХ}

Проанализируем полноту Викиданных.
\begin{itemize}
    \item По данным "Общероссийского классификатора стран мира"~\cite{Oksm} за 2016 год на земле существует 251 страна.
    \item В этой задаче не учитываются древние, уже не существующие государства (например: \href{https://www.wikidata.org/wiki/Q41137}{Ассирия (Q41137)}), поскольку они являются экземпляром не объекта "country", а объекта "former country" (бывшие страны). Отметим, что количество бывших стран на порядок больше существующих ныне стран (см. \href{https://query.wikidata.org/#SELECT%20%3Fitem%20%3Flabel%20%3F_image%20WHERE%20%7B%0A%20%20%3Fitem%20wdt%3AP31%20wd%3AQ3024240.%0A%20%20SERVICE%20wikibase%3Alabel%20%7B%0A%20%20%20%20bd%3AserviceParam%20wikibase%3Alanguage%20%22en%22%20.%20%0A%20%20%20%20%3Fitem%20rdfs%3Alabel%20%3Flabel%0A%20%20%7D%0A%20%20%0AOPTIONAL%20%7B%20%3Fitem%20wdt%3AP18%20%3F_image.%20%7D%0A%7D%0A}{SPARQL-запрос}, возвращающий более двух тысяч таких стран).

    \item По данным категории \href{https://ru.wikipedia.org/wiki/%D0%90%D0%BB%D1%84%D0%B0%D0%B2%D0%B8%D1%82%D0%BD%D1%8B%D0%B9_%D1%81%D0%BF%D0%B8%D1%81%D0%BE%D0%BA_%D1%81%D1%82%D1%80%D0%B0%D0%BD_%D0%B8_%D1%82%D0%B5%D1%80%D1%80%D0%B8%D1%82%D0%BE%D1%80%D0%B8%D0%B9}{"Алфавитный список стран и территорий"} Русской Википедии существует  252 страны. (В "Общероссийском классификаторе стран мира" недостает \href{https://www.wikidata.org/wiki/Q1246}{Косово})

    \item По данным категории \href{https://www.wikipedia.org/wiki/en:List_of_sovereign_states}{"List of sovereign states"} Английской Википедии существует 206 стран.
    \end{itemize}

Не всегда можно точно указать дату основания страны по разным причинам: отсутствие, недостаток или противоречие письменных источников. Например, основание Древнерусского государства связывают с призванием варяжского князя Рюрика в 862 году, но точной даты нет (объект \href{https://www.wikidata.org/wiki/Q159} {Russia (Q159)}). Так же некоторым современным странам предшествовал ряд других и дату образования какого из них считать за дату создания современной страны -- это вопрос открытый (например, \href{https://www.wikidata.org/wiki/Q711}{Монголия (Q711)}).


\section{СТРАНЫ С НЕЗАПОЛНЕННОЙ ДАТОЙ ОСНОВАНИЯ}

Выведем список стран с пустым свойством "дата основания":

\begin{itemize}
    \item Объект: \href{https://www.wikidata.org/wiki/Q6256}{страна (Q6256)},
    \item Свойство: \href{https://www.wikidata.org/wiki/Property:P571}{дата основания (P571)}.
\end{itemize}

\begin{lstlisting}[language=SPARQL, label=countrywithoutinception, caption=Список стран с пустым свойством "дата создания"]
#List of `instances of` "countries without an inception" 
SELECT ?country ?countryLabel 
WHERE
{
    ?country wdt:P31 wd:Q6256.       #country
    
    MINUS { ?country wdt:P571 [] } . #inception of country is empty
    SERVICE wikibase:label { bd:serviceParam wikibase:language "en" }
}
\end{lstlisting}

\href{https://query.wikidata.org/#%23List%20of%20%60instances%20of%60%20%22countries%20without%20a%20inception%22%20%0ASELECT%20%3Fcountry%20%3FcountryLabel%20%0AWHERE%0A%7B%0A%20%20%20%20%3Fcountry%20wdt%3AP31%20wd%3AQ6256.%20%23country%0A%20%20%20%20%0A%20%20%20%20MINUS%20%7B%20%3Fcountry%20wdt%3AP571%20%5B%5D%20%7D%20.%20%23inception%20of%20country%0A%20%20%20%20SERVICE%20wikibase%3Alabel%20%7B%20bd%3AserviceParam%20wikibase%3Alanguage%20%22en%22%20%7D%0A%7D%0A%0A}{SPARQL-запрос}, 100 записей.

Итак, на 6 марта 2017 года Викиданные содержат 100 из 198 записей о ныне существующих странах с неизвестным годом основания страны.~\ref{countrywithoutinception}

\section{ЭТНОХОРОНИМЫ НА РУССКОМ ЯЗЫКЕ}
Этнохороним -- название жителей определённой местности соотнесённое с топонимом. Например, Россия -- россияне, россиянин, россиянка, Чехия -- чехи, чех, чешка.

Помимо географического мотиватора, новых лексемы, используемые для определения происхождения либо принадлежности, происходят так же от этнических, политических, религиозных характеристик людей. 

Название жителей может исходить от наименования различных объектов земной поверхности — гор, островов, континентов. Так же обозначение места происхождения людей может зависеть от политико-административного делению. Например, для обозначения гражданства; Украина -- украинцы, Канада -- канадцы. Внутригосударственное деление так же может породить новые наименования, Крым -- крымчане. ~\cite{Zhuravleva}

Построим список стран у которых есть этнохоронимы на русском языке.

\begin{itemize}
\item Объект: \href{https://www.wikidata.org/wiki/Q6256}{страна (Q6256)},
\item Свойство: \href{https://www.wikidata.org/wiki/Property:P1549}{этнохороним (P1549)}.
\end{itemize}

\begin{lstlisting}[language=SPARQL, label=countrydemonyms, caption=Список стран с этнохоронимами на русском языке]
#List of countries with demonyms in Russian
SELECT ?country ?countryLabel 
WHERE
{
    ?country wdt:P31 wd:Q6256. #country
    ?country wdt:P1549 ?demonym . #demonym
    
    FILTER((LANG(?demonym)) = "ru")
    
    SERVICE wikibase:label { bd:serviceParam wikibase:language "ru" }
}
GROUP BY ?country ?countryLabel
\end{lstlisting}

\href{https://query.wikidata.org/#%23List%20of%20countries%20with%20demonyms%20in%20Russian%0ASELECT%20%3Fcountry%20%3FcountryLabel%20%0AWHERE%0A%7B%0A%09%3Fcountry%20wdt%3AP31%20wd%3AQ6256.%20%20%20%20%20%20%20%23country%0A%09%3Fcountry%20wdt%3AP1549%20%3Fdemonym%20.%20%20%20%20%23demonym%0A%09FILTER%28%28LANG%28%3Fdemonym%29%29%20%3D%20%22ru%22%29%0A%09SERVICE%20wikibase%3Alabel%20%7B%20bd%3AserviceParam%20wikibase%3Alanguage%20%22ru%22%20%7D%0A%7D%0A%0AGROUP%20BY%20%3Fcountry%20%3FcountryLabel}{SPARQL-запрос}, 28 записей.

На 19 марта 2017 года Викиданные содежали 28 из 198 стран с заполненными этнохоронимами на русском языке.~\ref{countrydemonyms}

\section{СПИСОК ЭТНОХОРОНИМОВ}

Выведем список всех этнохоронимом на русском языке.
\begin{lstlisting}[language=SPARQL, label=listdemonym, caption=Список этнохоронимов на русском языке]
#List of demonyms in Russian
SELECT ?country ?countryLabel ?demonym
WHERE
{
    ?country wdt:P31 wd:Q6256. #country
    ?country wdt:P1549 ?demonym. #demonym
    
    FILTER((LANG(?demonym)) = "ru")
    
    SERVICE wikibase:label { bd:serviceParam wikibase:language "ru" }
}
\end{lstlisting}

\href{https://query.wikidata.org/#%23List%20of%20demonyms%20in%20Russian%0ASELECT%20%3Fcountry%20%3FcountryLabel%20%3Fdemonym%0AWHERE%0A%7B%0A%09%3Fcountry%20wdt%3AP31%20wd%3AQ6256.%20%20%20%20%20%20%23country%0A%09%3Fcountry%20wdt%3AP1549%20%3Fdemonym%20.%20%20%20%23demonym%0A%09FILTER%28%28LANG%28%3Fdemonym%29%29%20%3D%20%22ru%22%29%0A%09SERVICE%20wikibase%3Alabel%20%7B%20bd%3AserviceParam%20wikibase%3Alanguage%20%22ru%22%20%7D%0A%7D}{SPARQL-запрос}, 83 записей.

На 19 марта 2017 года Викиданные содежат 83 заполненных этнохоронима.~\ref{listdemonym}

\section{СТРАНЫ С НЕЗАПОЛНЕННЫМИ ЭТНОХОРОНИМАМИ}

Построим список стран, у которых нет этнохоронимов на русском языке.

\begin{lstlisting}[language=SPARQL, label=countrywithoutdemonyms, caption=Список стран у которых нет этнохоронимов на русском языке]
#List of countries without demonyms in Russian
SELECT ?country ?countryLabel 
WHERE
{
    ?country wdt:P31 wd:Q6256. # country
    
    MINUS {
        ?country wdt:P1549 ?demonym. # except with demonyms
        FILTER((LANG(?demonym)) = "ru") # in Russian
    } 
    SERVICE wikibase:label { bd:serviceParam wikibase:language "ru" }
}
GROUP BY ?country ?countryLabel
\end{lstlisting}

\href{https://query.wikidata.org/#%23List%20of%20countries%20without%20demonyms%20in%20Russian%0ASELECT%20%3Fcountry%20%3FcountryLabel%20%0AWHERE%0A%7B%0A%09%3Fcountry%20wdt%3AP31%20wd%3AQ6256.%20%20%20%20%20%20%20%20%20%20%20%20%20%20%23%20country%0A%09MINUS%20%7B%20%3Fcountry%20wdt%3AP1549%20%3Fdemonym.%20%20%20%20%23%20except%20with%20demonyms%0A%20%20%20%20%20%20%20%20%20%20%20%20FILTER%28%28LANG%28%3Fdemonym%29%29%20%3D%20%22ru%22%29%20%23%20in%20Russian%0A%20%20%20%20%20%20%20%20%20%20%7D%20%20%20%20%0A%20%20%20%20%0A%09SERVICE%20wikibase%3Alabel%20%7B%20bd%3AserviceParam%20wikibase%3Alanguage%20%22ru%22%20%7D%0A%7D%0AGROUP%20BY%20%3Fcountry%20%3FcountryLabel}{SPARQL-запрос}, 170 записей. 

На 19 марта 2017 года Викиданные содержат 170 из 198 стран с незаполненными этнохоронимами.~\ref{countrywithoutdemonyms}

После заполнения авторами статьи этнохоронимов, число стран, у которых их нет на русском языке стало 69, а самих этнохоронимов на русском языке теперь 276 (на 20 марта 2017 года).

\section{КОЛИЧЕСТВО ЗАПОЛНЕННЫХ ЭТНОХОРОНИМОВ У СТРАН}

Выведем список стран, упорядоченный по количеству заполненных в Викиданных этнохоронимов.

\begin{lstlisting}[language=SPARQL, label=countcountry, caption=Cтраны упорядоченные по количеству заполненных этнохоронимов]
#Сount of demonyms in countries
SELECT ?country ?countryLabel (count(*) as ?count)
WHERE
{
    ?country wdt:P31 wd:Q6256. # country
    ?country wdt:P1549 ?demonym. # demonyms
    SERVICE wikibase:label { bd:serviceParam wikibase:language "ru" }
}
GROUP BY ?country ?countryLabel
ORDER BY DESC(?count)
\end{lstlisting}

\href{https://query.wikidata.org/#%23Count%20of%20demonyms%20in%20countries%0ASELECT%20%20%3Fcountry%20%3FcountryLabel%20%28count%28%2a%29%20as%20%3Fcount%29%0AWHERE%0A%7B%0A%09%3Fcountry%20wdt%3AP31%20wd%3AQ6256.%20%20%20%20%20%20%23country%0A%09%3Fcountry%20wdt%3AP1549%20%3Fdemonym%20.%20%20%20%23demonym%0A%09SERVICE%20wikibase%3Alabel%20%7B%20bd%3AserviceParam%20wikibase%3Alanguage%20%22ru%22%20%7D%0A%7D%0A%0AGROUP%20BY%20%3Fcountry%20%3FcountryLabel%20%0AORDER%20BY%20DESC%28%3Fcount%29%0A}{SPARQL-запрос}, 199 записей. 

Наибольшее число этнохоронимов у Соединённых Штатов Америки (41 этнохороним), затем идут Великобритания (40), Германия (40), Канада (36) и Россия (34).~\ref{countcountry}

\section{ФОРМЫ ПРАВЛЕНИЯ СТРАН}

Построим пузырьковую диаграмму форм правления стран.

\begin{itemize}
    \item Объект: \href{https://www.wikidata.org/wiki/Q6256}{страна (Q6256)},
    \item Свойство: \href{https://www.wikidata.org/wiki/Property:P122}{форма правления (P122)}.
\end{itemize}

\begin{lstlisting}[language=SPARQL, label=government, caption=Пузырьковая диаграмма форм правления стран]
#basic form of government ranking
#defaultView:BubbleChart
SELECT ?bfog ?form (count(*) as ?count)
WHERE 
{
    ?country wdt:P31 wd:Q6256.  #country
    ?country wdt:P122 ?bfog .   #basic form of government
    OPTIONAL {
		?bfog rdfs:label ?form
		filter (lang(?form) = "ru")
	}
}
GROUP BY ?bfog ?form
ORDER BY DESC(?count) ASC(?form)
\end{lstlisting}

\href{https://query.wikidata.org/#%23basic%20form%20of%20government%20ranking%0A%23defaultView%3ABubbleChart%0ASELECT%20%3Fbfog%20%3Fform%20%28count%28%2a%29%20as%20%3Fcount%29%0AWHERE%20%0A%7B%0A%20%20%20%20%3Fcountry%20wdt%3AP31%20wd%3AQ6256.%0A%20%20%20%20%3Fcountry%20wdt%3AP122%20%3Fbfog%20.%0A%20%20%20%20OPTIONAL%20%7B%0A%09%09%3Fbfog%20rdfs%3Alabel%20%3Fform%0A%09%09filter%20%28lang%28%3Fform%29%20%3D%20%22ru%22%29%0A%09%7D%0A%7D%0AGROUP%20BY%20%3Fbfog%20%3Fform%0AORDER%20BY%20DESC%28%3Fcount%29%20ASC%28%3Fform%29}{SPARQL-запрос}, 30 записей.

\begin{figure}[h]
\center{\includegraphics[width=0.5\linewidth]{Bubble_chart_forms_of_government_countries_accordi}}
\caption{Пузырьковая диаграмма форм правления стран.}
\label{ris:Bubble_chart_forms_of_government_countries_accordi}
\end{figure}

В результате выполнения запроса ~\ref{government} мы получаем пузырьковую диаграмму ~\ref{ris:Bubble_chart_forms_of_government_countries_accordi} с наиболее распространенными формами правления в странах. 
Основные формы правления стран: республика (в 20 странах), конституционная монархия (в 18 странах), федеративная республика (в 18 странах), парламентская республика (в 17 странах) и президентская республика (в 12 странах).  

\section{СОСЕДНИЕ СТРАНЫ}

Построим граф соседних стран.

\begin{itemize}
    \item Объект: \href{https://www.wikidata.org/wiki/Q6256}{страна (Q6256)},
    \item Свойство: \href{https://www.wikidata.org/wiki/Property:P47}{имеет границы с (P47)}.
\end{itemize}

\begin{lstlisting}[language=SPARQL, label=borderWith, caption=Граф соседних стран]
#neighboring countries graph
#defaultView:Graph
SELECT ?country ?countryLabel ?sharesBorderWith ?sharesBorderWithLabel
WHERE
{
    ?country wdt:P31 wd:Q6256.                         #countries

    SERVICE wikibase:label { bd:serviceParam wikibase:language "ru" }
    OPTIONAL { ?country wdt:P47 ?sharesBorderWith . }  #shares border with
}
\end{lstlisting}

\href{https://query.wikidata.org/#%23neighboring%20countries%20graph%0A%23defaultView%3AGraph%0ASELECT%20%3Fcountry%20%3FcountryLabel%20%3FsharesBorderWith%20%3FsharesBorderWithLabel%0AWHERE%0A%7B%0A%20%20%20%20%3Fcountry%20wdt%3AP31%20wd%3AQ6256.%0A%0A%20%20%20%20SERVICE%20wikibase%3Alabel%20%7B%20bd%3AserviceParam%20wikibase%3Alanguage%20%22ru%22%20%7D%0A%20%20%20%20OPTIONAL%20%7B%20%3Fcountry%20wdt%3AP47%20%3FsharesBorderWith%20.%20%7D%0A%0A%7D%0A}{SPARQL-запрос}, 787 записей.

В результате выполнения запроса ~\ref{borderWith} мы получаем граф ~\ref{ris:Neighboring_countries_graph_in_russian_according_t} с 787 ребрами, где ребро -- это соседство между двумя странами. Граф представляет из себя несколько связных компонент, так как есть островные страны, у которых нет соседей (например, \href{https://www.wikidata.org/Q1027}{Маврикий}, \href{https://www.wikidata.org/Q826}{Мальдивы}, \href{https://www.wikidata.org/Q1019}{Мадагаскар}). 

\begin{figure}[h!]
\includegraphics[width=0.9\linewidth]{Neighboring_countries_graph_in_russian_according_t}
\caption{Граф соседних стран, в центре Россия.}
\label{ris:Neighboring_countries_graph_in_russian_according_t}
\end{figure}

\newpage
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%Библиографический список
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
\begin{Rtwocolbib}%Не убирать!!!
%Для книг: Фамилии И.О. всех авторов. Заглавие издания.
%Город~: Издательство, год издания. Количество страниц.
%Например:/1}
\bibitem{Oksm}
\textit{Общероссийский классификатор стран мира} URL: http://classifikators.ru/oksm  (дата обращения: 11.11.2017).

\bibitem{Zhuravleva}
\textit{Н.Ю. Журавлева} Особенности перевода катойконимов (на материале испанского и русского языков) // Вестник Российского университета дружбы народов. — 2012. — P. 41–48.

\end{Rtwocolbib}%Не убирать!!!

\language=0%English


\Eauthor{A.~A.~Krizhanovsky$^1$, E.~M.~Smykova$^2$}%

%На англ. языке: Имя О. Фамилия, официальное название организации, почтовый адрес
%организации, e-mail автора
\Eaffil{$^1$Elizaveta M. Smykova, ORCID: 0000-0002-0426-2046, Petrozavodsk State University, 33, Lenina str., Petrozavodsk, Russia, 185910, esmykova8@gmail.com \\
$^2$Andrew A. Krizhanovsky, ORCID: 0000-0002-7926-1347, Institute of Applied Mathematical Research of the Karelian Research Centre of the Russian Academy of Sciences, 11, Pushkinskayastr., Petrozavodsk, Russia, 185910, andrew.krizhanovsky@gmail.com}%

\Eabstract{This research is devoted to the study of countries based on the knowledge base of the Wikidata international project. SPARQL queries were used in order to analyse and compare "countries" objects in Wikidata. A list of all currently existing countries, a list of countries ordered by date of creation, a list of demonyms of countries were generated. A bubble chart with the forms of government of countries and a graph of neighboring countries were constructed. In addition, conclusions were drawn regarding the completeness of the Wikidata for this topic.}%

\Ekeywords{Wikidate, data analysis, countries}


%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%References - Библиографический список на англ. языке
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%


\begin{Etwocolbib}%Не убирать!!!
\bibitem{Oksm}
\textit{Russian classification of countries of the world} URL: http://classifikators.ru/oksm  (Accessed  11, November, 2017).

\bibitem{Zhuravleva}
\textit{N.Y. Zhuravleva} Features of translation katoykonimov (on a material of the Spanish and Russian languages) // Bulletin of the Peoples Friendship University of Russia. — 2012. — P. 41–48.


\end{Etwocolbib}%Не убирать!!!
\language=1%Русский



\end{document}
